# AddSegment Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostedSweep..::..AddSegment Method
HostedSweep Class See Also
---
Add segments to the hosted sweep object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract void AddSegment(
	Reference targetRef
)
```

Visual Basic
---
```text
Public MustOverride Sub AddSegment ( _
	targetRef As Reference _
)
```

Visual C++
---
```text
public:
virtual void AddSegment(
	Reference^ targetRef
) abstract
```

# ### Parameters
targetRef
    Type: Autodesk.Revit.DB..::..Reference
# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace